puntobello-realtimenews-webapp/development/loadtesthighlongrunning.yml
config:
 target: "@@azureWebapp@@"
 phases:
    - duration: 1200
      arrivalRate: 10
      rampTo: 20
      name: "Constant load"
engines:
   socketio-v3:
     pingInterval: 40000
     pingTimeout: 30000
     transports: ["websocket"]
scenarios:
  - name: Load test RedNet PubSub
    engine: "socketio-v3"
    flow:
      - think: 600 # do nothing for 10m and disconnect